app/Livewire/Admin/Service/Show.php

insert into `services` (`pin_code`, `updated_at`, `created_at`) values ('854303', '2025-10-07 17:24:45', '2025-10-07 17:24:45')
---
    public function saveService()
    {
        $this->validate();

        if ($this->editingId) {
            Service::find($this->editingId)->update(['pin_code' => $this->pin_code]);
            $message = 'Service updated successfully!';
        } else {
            Service::create(['pin_code' => $this->pin_code]);

select * from `services` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `services`
---
    public function render()
    {
        $services = Service::when($this->search, function ($query) {
                $query->where('pin_code', 'like', '%' . $this->search . '%');
            })
            ->orderBy('created_at', 'desc')
            ->paginate(5);