app/Livewire/Public/Components/CategoryPopup.php

    public function openCategoryModal($categorySlug)
    {
        $this->modalCategory = Category::with('children')->where('slug', $categorySlug)->first();
---
select * from `categories` where `slug` = 'mjnbvf' limit 1