app/Livewire/Public/Section/EnquiryForm.php

    public function render()
    {
        $parentCategory = Category::all();
---
select * from `categories`