app/Livewire/Public/Section/Homepage.php

select * from `categories` where `parent_id` is null order by `is_special` desc, `created_at` asc limit 9
select * from `event_packages` where `is_active` = 1 and `event_packages`.`deleted_at` is null order by `is_special` desc, `created_at` asc limit 6
---
    public function render()
    {
        $categories = Category::where('parent_id', null)
            ->orderByDesc('is_special')
            ->orderBy('created_at')
            ->limit(9)
            ->get();

        $packages = EventPackage::with(['category', 'images'])
            ->where('is_active', true)
            ->orderByDesc('is_special')
            ->orderBy('created_at')
            ->limit(6)
            ->get();

select * from `blogs` order by `created_at` desc limit 3
---
            'fas fa-mask',
            'fas fa-hands-helping'
        ];
        $blogs = Blog::latest()->take(3)->get();