app/Livewire/Public/Section/OtherSection.php

    public function render()
    {
        $packages = EventPackage::with(['category', 'images'])
            ->where('is_active', true)
            ->orderByDesc('is_special')
            ->orderBy('created_at')
            ->limit(6)
            ->get();
---
select * from `event_packages` where `is_active` = 1 and `event_packages`.`deleted_at` is null order by `is_special` desc, `created_at` asc limit 6