app/Livewire/Admin/Blog/CreateBlog.php

select * from `categories`
---
    public function mount()
    {
        $this->categories = Category::all();

insert into `blogs` (`title`, `content`, `status`, `user_id`, `category_id`, `slug`, `updated_at`, `created_at`) values ('jhgf', 'mnbvcd', 'published', 1, '1', 'jhgf', '2025-10-07 17:38:43', '2025-10-07 17:38:43')
insert into `blog_images` (`blog_id`, `image_url`, `image_file_id`, `is_featured`, `sort_order`, `updated_at`, `created_at`) values (1, 'https://ik.imagekit.io/734vtfi5p/Zuppie/Blogs/68e502cbe3b2b_ctIIAtSng.jpeg', '68e502cd5c7cd75eb894c756', 1, 1, '2025-10-07 17:38:45', '2025-10-07 17:38:45')
---
    public function saveBlog()
    {
        $this->validate();
        // dd($this->validate());
        try {
            // Create the blog
            $blog = Blog::create([
                'title' => $this->form['title'],
                'content' => $this->form['content'],
                'status' => $this->form['status'],
                'user_id' => auth()->id(),
                'category_id' => $this->form['category_id'] ?: null,
            ]);

            // Handle image uploads
            if (!empty($this->images)) {
                foreach ($this->images as $index => $image) {
                    $uploadResult = ImageKitHelper::uploadImage($image, 'Zuppie/Blogs');

                    if ($uploadResult) {
                        BlogImage::create([
                            'blog_id' => $blog->id,
                            'image_url' => $uploadResult['url'],
                            'image_file_id' => $uploadResult['fileId'],
                            'is_featured' => $index === 0, // First image is featured
                            'sort_order' => $index + 1,
                        ]);