app/Livewire/Admin/Blog/ManageBlog.php

select * from `blogs` order by `created_at` desc limit 6 offset 0
select * from `categories` where `categories`.`id` in (1)
select count(*) as aggregate from `blogs`
---
    public function render()
    {
        $blogs = Blog::with(['featuredImage', 'category'])
        ->when($this->search, function ($query) {
            $query->where('title', 'like', '%' . $this->search . '%')
                  ->orWhere('slug', 'like', '%' . $this->search . '%');
        })
        ->latest()
        ->paginate($this->perPage);