app/Livewire/Admin/Blog/UpdateBlog.php

select * from `categories`
---
    public function mount()
    {
        $this->categories = Category::all();

select * from `blogs` where `blogs`.`id` = 1 limit 1
---
    public function openModal($id)
    {
        $this->blogId = $id;
        $this->blog = Blog::with(['images', 'featuredImage', 'galleryImages'])->findOrFail($id);