app/Livewire/Public/Event/EventPackageFilter.php

    public function getFilteredPackagesProperty()
    {
        $query = EventPackage::with(['category', 'images'])
            ->where('is_active', true);

        if ($this->searchQuery) {
            $query->where(function ($q) {
                $q->where('name', 'like', '%' . $this->searchQuery . '%')
                    ->orWhere('description', 'like', '%' . $this->searchQuery . '%');
            });
        }

        if ($this->selectedCategory) {
            $category = Category::where('slug', $this->selectedCategory)->first();

            if ($this->selectedSubCategory) {
                $query->whereHas('category', function ($q) {
                    $q->where('slug', $this->selectedSubCategory);
                });
            } else if ($category) {
                $query->whereHas('category', function ($q) use ($category) {
                    $q->where('slug', $this->selectedCategory)
                        ->orWhere('parent_id', $category->id);
                });
---
select * from `event_packages` where `is_active` = 1 and exists (select * from `categories` where `event_packages`.`category_id` = `categories`.`id` and (`slug` = 'nbvcxz' or `parent_id` = 3)) and `event_packages`.`deleted_at` is null limit 15
select * from `categories` where `slug` = 'nbvcxz' limit 1

    public function getSimilarPackagesProperty()
    {
        // Only fetch similar packages if filters are applied (category or subcategory is selected)
        if ($this->selectedCategory || $this->selectedSubCategory) {
            return EventPackage::with(['category', 'images'])
                ->where('is_active', true)
                ->where('is_special', true)
                ->take(6)
                ->get();
---
select * from `event_packages` where `is_active` = 1 and `is_special` = 1 and 1 = 1 and `event_packages`.`deleted_at` is null limit 6

    public function getHasMorePackagesProperty()
    {
        $currentlyShowing = $this->packagesPerPage + ($this->loadMoreCount * $this->packagesPerPage);
        return EventPackage::where('is_active', true)->count() > $currentlyShowing;
---
select count(*) as aggregate from `event_packages` where `is_active` = 1 and `event_packages`.`deleted_at` is null