app/Livewire/Public/Event/EventPackage.php

    public function getPopularPackagesProperty()
    {
        // Get packages ordered by booking count (most booked first)
        $packages = EventPackageModel::with(['category', 'images'])
            ->where('is_active', true)
            ->withCount('bookings') // Add booking count
            ->orderBy('bookings_count', 'desc') // Order by most booked first
            ->orderBy('created_at', 'desc') // Secondary ordering by newest
            ->take(12) // Show more packages for horizontal scroll
            ->get();
---
select `event_packages`.*, (select count(*) from `bookings` where `event_packages`.`id` = `bookings`.`event_package_id`) as `bookings_count` from `event_packages` where `is_active` = 1 and `event_packages`.`deleted_at` is null order by `bookings_count` desc, `created_at` desc limit 12

    public function getSpecialCategoriesProperty()
    {
        // Get only 10 special categories
        return Category::where('is_special', true)
            ->whereNull('parent_id')
            ->take(10)
            ->get()
            ->map(function ($category) {
                return [
                    'id' => $category->id,
                    'name' => $category->name,
                    'slug' => $category->slug,
                    'description' => $category->description,
                    'packages' => $this->getCategoryPackages($category->id),
                    'icon' => $this->getCategoryIcon($category->slug)
                ];
            });
---
select * from `categories` where `is_special` = 1 and `parent_id` is null limit 10

    public function getCategoryPackages($categoryId)
    {
        $packages = EventPackageModel::with(['category', 'images'])
            ->where('is_active', true)
            ->where(function($query) use ($categoryId) {
                $query->where('category_id', $categoryId)
                      ->orWhereHas('category', function($q) use ($categoryId) {
                          $q->where('parent_id', $categoryId);
                      });
            })
            ->take(12) // Show more packages for horizontal scroll
            ->get();
---
select * from `event_packages` where `is_active` = 1 and (`category_id` = 1 or exists (select * from `categories` where `event_packages`.`category_id` = `categories`.`id` and `parent_id` = 1)) and `event_packages`.`deleted_at` is null limit 12

    public function getFilteredPackagesProperty()
    {
        $query = EventPackageModel::with(['category', 'images'])
            ->where('is_active', true);

        // Search filter
        if ($this->searchQuery) {
            $query->where(function ($q) {
                $q->where('name', 'like', '%' . $this->searchQuery . '%')
                    ->orWhere('description', 'like', '%' . $this->searchQuery . '%')
                    ->orWhereHas('category', function ($categoryQuery) {
                        $categoryQuery->where('name', 'like', '%' . $this->searchQuery . '%');
                    });
            });
        }

        // Category filter
        if ($this->selectedCategory) {
            $category = Category::where('slug', $this->selectedCategory)->first();

            if ($this->selectedSubCategory) {
                // Filter by specific subcategory
                $query->whereHas('category', function ($q) {
                    $q->where('slug', $this->selectedSubCategory);
                });
            } else if ($category) {
                // Filter by main category and its subcategories
                $query->whereHas('category', function ($q) use ($category) {
                    $q->where('slug', $this->selectedCategory)
                        ->orWhere('parent_id', $category->id);
                });
---
select * from `event_packages` where `is_active` = 1 and `event_packages`.`deleted_at` is null limit 15

    public function getTotalPackagesCountProperty()
    {
        $query = EventPackageModel::where('is_active', true);

        if ($this->searchQuery) {
            $query->where(function ($q) {
                $q->where('name', 'like', '%' . $this->searchQuery . '%')
                    ->orWhere('description', 'like', '%' . $this->searchQuery . '%')
                    ->orWhereHas('category', function ($categoryQuery) {
                        $categoryQuery->where('name', 'like', '%' . $this->searchQuery . '%');
                    });
            });
        }

        if ($this->selectedCategory) {
            if ($this->selectedSubCategory) {
                $query->whereHas('category', function ($q) {
                    $q->where('slug', $this->selectedSubCategory);
                });
            } else {
                $query->whereHas('category', function ($q) {
                    $category = Category::where('slug', $this->selectedCategory)->first();
                    if ($category) {
                        $q->where('slug', $this->selectedCategory)
                            ->orWhere('parent_id', $category->id);
                    }
                });
            }
        }

        return $query->count();
---
select count(*) as aggregate from `event_packages` where `is_active` = 1 and `event_packages`.`deleted_at` is null

    public function getFeaturedPackagesProperty()
    {
        $packages = EventPackageModel::with(['category', 'images'])
            ->where('is_active', true)
            ->where('is_special', true)
            ->take(6)
            ->get();
---
select * from `event_packages` where `is_active` = 1 and `is_special` = 1 and `event_packages`.`deleted_at` is null limit 6

    public function getCategoriesProperty()
    {
        // Get only special categories for main display (limit to 9)
        $categories = Category::where('is_special', true)
            ->whereNull('parent_id')
            ->take(9)
            ->get();

        $categoryData = [];
        foreach ($categories as $category) {
            $categoryData[$category->slug] = [
                'name' => $category->name,
                'icon' => $this->getCategoryIcon($category->slug),
                'image' => $category->image,
                'has_subcategories' => $category->children()->exists()
---
select * from `categories` where `is_special` = 1 and `parent_id` is null limit 9
select exists(select * from `categories` where `categories`.`parent_id` = 1 and `categories`.`parent_id` is not null) as `exists`

    public function getDisplayCategoriesProperty()
    {
        if ($this->showAllCategoriesMode) {
            // Show all categories (both special and non-special)
            return Category::with('children')
                ->whereNull('parent_id')
                ->get();
        } else {
            // Show only special categories (existing behavior)
            return Category::where('is_special', true)
                ->whereNull('parent_id')
                ->take(9)
                ->get();
---
select * from `categories` where `is_special` = 1 and `parent_id` is null limit 9

    public function getSimilarPackagesProperty()
    {
        // Show similar packages when there's a search, category selection, or no packages found
        if (!$this->searchQuery && !$this->selectedCategory && count($this->filteredPackages) > 0) {
            return collect([]);
        }

        $query = EventPackageModel::with(['category', 'images'])
            ->where('is_active', true);

        // Get packages from the same category as selected category
        if ($this->selectedCategory) {
            $category = Category::where('slug', $this->selectedCategory)->first();
            if ($category) {
                $query->whereHas('category', function ($q) use ($category) {
                    $q->where('id', $category->id)
                        ->orWhere('parent_id', $category->id);
                });
            }
        } else {
            // If no category selected but there's a search, or no packages found, show popular packages
            $query->where('is_special', true);
        }

        $packages = $query->take(6)->get();
---
select * from `event_packages` where `is_active` = 1 and `is_special` = 1 and `event_packages`.`deleted_at` is null limit 6