app/Livewire/Admin/Dashboard.php

    public function calculateStatistics()
    {
        // Upcoming Events (confirmed events from today onwards)
        $this->upcomingEventsCount = Booking::where('status', 'confirmed')
            ->whereDate('event_date', '>=', now()->toDateString())
            ->count();

        // Past Events (completed events)
        $this->pastEventsCount = Booking::where('status', 'confirmed')
            ->where('is_completed', 1)
            ->whereDate('event_date', '<', now()->toDateString())
            ->count();

        // Cancelled Events
        $this->cancelledEventsCount = Booking::where('status', 'cancelled')->count();

        // Total Revenue (online payments + completed cash payments)
        $onlinePayment = Payment::where('status', 'paid')->sum('amount');
        $cashPayment = Booking::where('is_completed', 1)->sum('due_amount');
---
select count(*) as aggregate from `bookings` where `status` = 'confirmed' and date(`event_date`) >= '2025-10-07'
select count(*) as aggregate from `bookings` where `status` = 'confirmed' and `is_completed` = 1 and date(`event_date`) < '2025-10-07'
select count(*) as aggregate from `bookings` where `status` = 'cancelled'
select sum(`amount`) as aggregate from `payments` where `status` = 'paid'
select sum(`due_amount`) as aggregate from `bookings` where `is_completed` = 1

    public function getCalendarEventsProperty()
    {
        $startDate = Carbon::create($this->currentYear, $this->currentMonth, 1)->startOfMonth()->format('Y-m-d');
        $endDate = Carbon::create($this->currentYear, $this->currentMonth, 1)->endOfMonth()->format('Y-m-d');

        return Booking::with('eventPackage')
            ->where('status', 'confirmed')
            ->whereBetween('event_date', [$startDate, $endDate])
            ->orderBy('event_date', 'asc')
            ->get()
            ->mapWithKeys(function ($booking) {
                $dateKey = $booking->event_date->format('Y-n-j');
                return [
                    $dateKey => [
                        'title' => $booking->eventPackage->name,
                        'type' => 'important',
                        'guests' => $booking->guest_count,
                        'id' => $booking->id
                    ]
                ];
            })
            ->toArray();
---
select * from `bookings` where `status` = 'confirmed' and `event_date` between '2025-10-01' and '2025-10-31' order by `event_date` asc

    public function getMonthlyRevenueData()
    {
        $monthlyData = [];

        // Use current year and show all 12 months
        $currentYear = \Carbon\Carbon::now(config('app.timezone', 'UTC'))->year;

        // Generate all 12 months of current year (January to December)
        for ($month = 1; $month <= 12; $month++) {
            $targetDate = \Carbon\Carbon::create($currentYear, $month, 1);
            $monthName = $targetDate->format('M');

            $monthlyRevenue = Payment::where('status', 'paid')
                ->whereYear('created_at', $currentYear)
                ->whereMonth('created_at', $month)
                ->sum('amount');

            $monthlyCash = Booking::where('is_completed', 1)
                ->whereYear('updated_at', $currentYear)
                ->whereMonth('updated_at', $month)
                ->sum('due_amount');
---
select sum(`amount`) as aggregate from `payments` where `status` = 'paid' and year(`created_at`) = 2025 and month(`created_at`) = '01'
select sum(`due_amount`) as aggregate from `bookings` where `is_completed` = 1 and year(`updated_at`) = 2025 and month(`updated_at`) = '01'

    public function render()
    {
        $upComingBookings = Booking::with('eventPackage')
            ->where('status', 'confirmed')
            ->whereDate('event_date', '>=', now()->toDateString())
            ->orderBy('event_date', 'asc')
            ->paginate($this->perPage);
---
select count(*) as aggregate from `bookings` where `status` = 'confirmed' and date(`event_date`) >= '2025-10-07'
select * from `bookings` where `status` = 'confirmed' and date(`event_date`) = '2025-10-07'