app/Livewire/Admin/EventPackage/ListPackage.php

    public function toggleActive($packageId)
    {
        $this->updatingStatus = true;
        $package = EventPackage::findOrFail($packageId);
        $package->is_active = !$package->is_active;
        $package->save();
---
select * from `event_packages` where `event_packages`.`id` = 1 and `event_packages`.`deleted_at` is null limit 1
update `event_packages` set `is_active` = 0, `event_packages`.`updated_at` = '2025-10-07 17:18:33' where `id` = 1

    public function mount()
    {
        $this->categories = Category::orderBy('name')->get();
---
select * from `categories` order by `name` asc

    public function render()
    {
        $query = EventPackage::query()
            ->with(['category', 'images']);

        // Apply search filter
        if (!empty($this->search)) {
            $query->where('name', 'like', '%' . $this->search . '%')
                  ->orWhere('description', 'like', '%' . $this->search . '%');
        }

        // Apply category filter
        if (!empty($this->categoryFilter)) {
            $query->where('category_id', $this->categoryFilter);
        }

        // Make sure we're using an integer for pagination
        $perPage = 5;

        return view('livewire.admin.event-package.list-package', [
            'packages' => $query->orderBy('created_at', 'desc')->paginate($perPage),
            'categories' => $this->categories,
        ]);
---
select * from `event_packages` where `event_packages`.`deleted_at` is null order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `event_packages` where `event_packages`.`deleted_at` is null