app/Livewire/Admin/EventPackage/ViewPackage.php

    public function mount($packageId)
    {
        $this->package = EventPackage::with(['category', 'images'])->findOrFail($packageId);
---
select * from `event_packages` where `event_packages`.`id` = 1 and `event_packages`.`deleted_at` is null limit 1

    public function deleteImage()
    {
        $image = \App\Models\EventPackageImage::find($this->imageToDelete);
---
select * from `event_package_images` where `event_package_images`.`event_package_id` in (1) and `event_package_images`.`deleted_at` is null