app/Livewire/Admin/Category/Create.php

    public function openModal($editId = null)
    {
        $this->resetForm();
        $this->editingId = $editId;

        if ($editId) {
            $category = Category::findOrFail($editId);
---
select * from `categories` where `categories`.`id` = 1 limit 1

                $category->update($data);
                $message = 'Category updated successfully!';
            } else {
                Category::create($data);
---
insert into `categories` (`name`, `description`, `parent_id`, `is_special`, `image`, `image_file_id`, `slug`, `updated_at`, `created_at`) values ('nbvcxz', 'mnbvc', null, 1, 'https://ik.imagekit.io/734vtfi5p/Zuppie/CategoryImages/68e4d1905f7ca_OJdiW9vYq.jpeg', '68e4d1915c7cd75eb83ec035', 'nbvcxz', '2025-10-07 14:08:42', '2025-10-07 14:08:42')

    public function render()
    {
        $parentCategories = Category::when($this->editingId, function ($query) {
            $query->where('id', '!=', $this->editingId);
        })->whereNull('parent_id')->get();
---
select * from `categories` where `id` != 1 and `parent_id` is null