app/Livewire/Admin/Category/Show.php

select * from `categories` where `categories`.`id` in (1)
select count(*) as aggregate from `categories`
---
    public function render()
    {
        $categories = Category::when($this->search, function ($query) {
            $query->where('name', 'like', '%' . $this->search . '%')
                  ->orWhere('description', 'like', '%' . $this->search . '%');
        })->with('parent')->latest()->paginate(8);