app/Models/Blog.php

select exists(select * from `blogs` where `slug` = 'jhgf') as `exists`
---
    protected static function makeUniqueSlug($title, $excludeId = null)
    {
        $slug = Str::slug($title);
        $originalSlug = $slug;
        $count = 2;

        $query = static::where('slug', $slug);

        if ($excludeId) {
            $query->where('id', '!=', $excludeId);
        }

        while ($query->exists()) {