app/Models/Category.php

select exists(select * from `categories` where `slug` = 'nbvcxz') as `exists`
---
    protected static function boot()
    {
        parent::boot();

        static::creating(function ($category) {
            $category->slug = Str::slug($category->name);

            // Ensure slug is unique
            $originalSlug = $slug = $category->slug;
            $count = 2;

            while (static::where('slug', $slug)->exists()) {