app/Models/Setting.php

select * from `settings` where `key` = 'site_name' limit 1
---
    public static function get($key, $default = null)
    {
        $setting = static::where('key', $key)->first();