app/Livewire/Admin/User/ManageUser.php

select * from `users` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `users`
---
     public function render()
    {
        $users = User::when($this->search, function ($query) {
                return $query->where('name', 'like', '%'.$this->search.'%')
                    ->orWhere('email', 'like', '%'.$this->search.'%')
                    ->orWhere('phone_no', 'like', '%'.$this->search.'%');
            })
            ->orderBy('created_at', 'desc')
            ->paginate(5);