app/Livewire/Admin/Enquiry/AllEnquiry.php

select * from `enquiries` where `status` = 'pending'
---
     public function mount()
    {
        $this->enquiries = Enquiry::where('status', 'pending')->get();
        $this->resolvedEnquiry = Enquiry::where('status', 'resolved')->get();