app/Livewire/Admin/Reviews/All.php

    public function mount()
    {
        $this->reviews = reviews::where('approved', false)->get();
        $this->approvedReviews = reviews::where('approved', true)->get();
---
select * from `reviews` where `approved` = 0
select * from `reviews` where `approved` = 1